{
  "format": "layers-model",
  "generatedBy": "keras v2.8.0",
  "convertedBy": "TensorFlow.js Converter v3.8.0",
  "modelTopology": {
    "keras_version": "2.8.0",
    "backend": "tensorflow",
    "model_config": {
      "class_name": "Sequential",
      "config": {
        "name": "sequential_1",
        "layers": [
          {
            "class_name": "Conv2D",
            "config": {
              "filters": 32,
              "kernel_size": [3, 3],
              "activation": "relu",
              "input_shape": [224, 224, 3]
            }
          },
          {
            "class_name": "MaxPooling2D",
            "config": {
              "pool_size": [2, 2]
            }
          },
          {
            "class_name": "Flatten",
            "config": {}
          },
          {
            "class_name": "Dense",
            "config": {
              "units": 5,
              "activation": "sigmoid"
            }
          }
        ]
      }
    }
  },
  "weightsManifest": [
    {
      "paths": ["weights.bin"],
      "weights": [
        {"name": "conv2d/kernel", "shape": [3, 3, 3, 32], "dtype": "float32"},
        {"name": "conv2d/bias", "shape": [32], "dtype": "float32"},
        {"name": "dense/kernel", "shape": [111392, 5], "dtype": "float32"},
        {"name": "dense/bias", "shape": [5], "dtype": "float32"}
      ]
    }
  ]
} 